/*
 * @Descripttion: 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 * @version: April 2021 (version 1.56)
 * @Author: ZhangKe
 * @Date: 2022-05-20 15:24:31
 * @LastEditors: ZhangKe
 * @LastEditTime: 2022-05-20 15:34:08
 * @FilePath: \22_微信小程序\01_小程序与普通网页开发的区别.js
 */
// 小程序与普通网页开发的区别:

// 1. 运行环境不同:
// 网页运行在浏览器环境中, 小程序运行在微信环境中.

// 2. API 不同:
// 由于运行环境的不同, 所以小程序中, 无法调用 DOM 和 BOM 的 API.
// 但是, 小程序可以调用微信环境提供的各种 API, 例如, 地理位置, 扫码, 支付...

// 3. 开发模式不同:
// 网页的开发模式: 浏览器+代码编辑器
// 小程序有自己的一套标准开发模式: 
// 1. 申请小程序开发账号;
// 2. 安装小程序开发者工具;
// 3. 创建和配置小程序项目;

// --------------------------------------------------------------

// 微信搜索小程序 '小程序示例' 即可看到官方的示例.