/*
 * @Descripttion: 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 * @version: April 2021 (version 1.56)
 * @Author: ZhangKe
 * @Date: 2022-05-22 19:21:39
 * @LastEditors: ZhangKe
 * @LastEditTime: 2022-05-22 20:19:36
 * @FilePath: \22_微信小程序\22_协同工作--小程序的上传.js
 */
// 注意: 一个小程序管理后台只能拥有一个小程序, 意味着你只能发布一个小程序项目.
//      一个身份证最多只能注册微信公众平台 5 次, 意味着一个身份证只能拥有 5 个小程序管理后台, 即最多 5 个小程序项目.

// 小程序发布上线的整体步骤:
// 一个小程序的发布上线, 一般要经过 上传代码 --> 提交审核 --> 发布 这三个步骤.

// 1. 上传代码：
// 点击开发者工具顶部工具栏中的 "上传" 按钮；
// 填写版本号以及项目备注；

// 2. 在后台查看上传之后的版本：
// 登陆小程序管理后台 --> 管理 --> 版本管理 --> 开发版本， 即可查看刚才提交上传的版本了。

// 3. 提交审核：
// 点击 "提交审核" 按钮, 按照页面提示的相关信息， 就能把小程序提交到腾讯官方进行审核。