/*
 * @Descripttion: 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 * @version: April 2021 (version 1.56)
 * @Author: ZhangKe
 * @Date: 2022-05-23 08:22:50
 * @LastEditors: ZhangKe
 * @LastEditTime: 2022-05-23 08:28:36
 * @FilePath: \22_微信小程序\23_协同工作--小程序码的推广和运营数据查看.js
 */
// 基于小程序码进行推广
// 相对于普通二维码来说， 小程序码的优势如下：
// 1. 在样式上更具辨识度和视觉冲击力；
// 2. 清晰树立小程序的品牌形象；
// 3. 更好的推广小程序；

// 获取小程序码的 5 个步骤：
// 登陆管理后台 --> 设置 --> 基本设置 --> 基本信息 --> 小程序码及线下物料下载


// -------------------------------------------------

// 查看小程序运营数据的两种方式：
// 1. 在 "小程序后台" 查看
//    登陆小程序 -- 点击侧边栏的 "统计" -- 点击相应的 tab 可以看到相关的数据
// 2. 使用 "小程序数据助手" 查看
//    打开微信 -- 搜索 "小程序数据助手" -- 查看已发布的小程序相关的数据